cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xL.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DS" -->
    <peripheral>
      <name>DS</name>
      <description>Low Power Consumption Mode</description>
      <groupName>DS</groupName>
      <baseAddress>0x40035800</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x16</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PMD_CTL" -->
        <register>
          <name>PMD_CTL</name>
          <description>RTC Mode Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCE" -->
            <field>
              <name>RTCE</name>
              <description>RTC mode control bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRFSR" -->
        <register>
          <name>WRFSR</name>
          <description>Deep Standby Return Cause Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WLVDH" -->
            <field>
              <name>WLVDH</name>
              <description>Low-voltage detection reset return bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WINITX" -->
            <field>
              <name>WINITX</name>
              <description>INITX pin input reset return bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WIFSR" -->
        <register>
          <name>WIFSR</name>
          <description>Deep Standby Return Cause Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI3" -->
            <field>
              <name>WUI3</name>
              <description>WKUP pin input return bit 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI2" -->
            <field>
              <name>WUI2</name>
              <description>WKUP pin input return bit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI1" -->
            <field>
              <name>WUI1</name>
              <description>WKUP pin input return bit 1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI0" -->
            <field>
              <name>WUI0</name>
              <description>WKUP pin input return bit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WLVDI" -->
            <field>
              <name>WLVDI</name>
              <description>LVD interrupt return bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRTCI" -->
            <field>
              <name>WRTCI</name>
              <description>RTC interrupt return bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WIER" -->
        <register>
          <name>WIER</name>
          <description>Deep Standby Return Enable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI3E" -->
            <field>
              <name>WUI3E</name>
              <description>WKUP pin input return enable bit 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2E" -->
            <field>
              <name>WUI2E</name>
              <description>WKUP pin input return enable bit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1E" -->
            <field>
              <name>WUI1E</name>
              <description>WKUP pin input return enable bit 1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WLVDE" -->
            <field>
              <name>WLVDE</name>
              <description>LVD interrupt return enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRTCE" -->
            <field>
              <name>WRTCE</name>
              <description>RTC interrupt return enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WILVR" -->
        <register>
          <name>WILVR</name>
          <description>WKUP Pin Input Level Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI3LV" -->
            <field>
              <name>WUI3LV</name>
              <description>WKUP pin input level select bit 3</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2LV" -->
            <field>
              <name>WUI2LV</name>
              <description>WKUP pin input level select bit 2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1LV" -->
            <field>
              <name>WUI1LV</name>
              <description>WKUP pin input level select bit 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BUR01" -->
        <register>
          <name>BUR01</name>
          <description>Backup Registers from 1</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR02" -->
        <register>
          <name>BUR02</name>
          <description>Backup Registers from 2</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR03" -->
        <register>
          <name>BUR03</name>
          <description>Backup Registers from 3</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR04" -->
        <register>
          <name>BUR04</name>
          <description>Backup Registers from 4</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR05" -->
        <register>
          <name>BUR05</name>
          <description>Backup Registers from 5</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR06" -->
        <register>
          <name>BUR06</name>
          <description>Backup Registers from 6</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
